/*
filename:	io.h
author:	wei-coder
date:	2017-12
purpose:	IO操作的头文件，内联函数定义
*/

#ifndef __IO_H
#define __IO_H

#include "types.h"


/**************************************************************
函数说明: 向端口写两个字节
***************************************************************/
#define outw(port,value)\
	asm volatile("outw %%al,%%dx"::"a" (value),"d" (port))


/**************************************************************
函数说明: 向端口写一个字节
***************************************************************/
#define outb(port,value) \
__asm__ ("outb %%al,%%dx"::"a" (value),"d" (port))


/**************************************************************
函数说明: 向端口读一个字节
***************************************************************/
#define inb(port) ({ \
unsigned char _v; \
__asm__ volatile ("inb %%dx,%%al":"=a" (_v):"d" (port)); \
_v; \
})

/**************************************************************
函数说明: 带延迟的向端口写一个字节函数
***************************************************************/
<<<<<<< HEAD
=======
static inline void outw(u16 port)
{
	u16 ret;
	asm volatile("inw %1, %0": "=a"(ret):"dN"(port));
};


>>>>>>> 2747b789ab05c6901e2e08b9db7fbb72fd8f6f24
#define outb_p(value,port) \
__asm__ ("outb %%al,%%dx\n" \
        "\tjmp 1f\n" \
        "1:\tjmp 1f\n" \
        "1:"::"a" (value),"d" (port))

<<<<<<< HEAD
/**************************************************************
函数说明: 带延迟的向端口读一个字节函数
***************************************************************/
=======
>>>>>>> 2747b789ab05c6901e2e08b9db7fbb72fd8f6f24
#define inb_p(port) ({ \
unsigned char _v; \
__asm__ volatile ("inb %%dx,%%al\n" \
    "\tjmp 1f\n" \
    "1:\tjmp 1f\n" \
    "1:":"=a" (_v):"d" (port)); \
_v; \
})


#endif
